HadyBazzi/ESP32_AI_Connect/src/AI_API_OpenAI.cpp
            // Copy function properties
            if (!srcFunction["name"].isNull()) {
                function["name"] = srcFunction["name"].as<String>();
            }
            
            if (!srcFunction["description"].isNull()) {
                function["description"] = srcFunction["description"].as<String>();
            }
            
            if (!srcFunction["parameters"].isNull()) {
                JsonObject params = function["parameters"].to<JsonObject>();
                JsonObject srcParams = srcFunction["parameters"];
                
                for (JsonPair kv : srcParams) {
                    if (kv.value().is<JsonObject>()) {
                        JsonObject subObj = params[kv.key().c_str()].to<JsonObject>();
                        JsonObject srcSubObj = kv.value().as<JsonObject>();
                        
                        for (JsonPair subKv : srcSubObj) {
                            subObj[subKv.key().c_str()] = subKv.value();
                        }
                    } else if (kv.value().is<JsonArray>()) {
                        JsonArray arr = params[kv.key().c_str()].to<JsonArray>();
                        JsonArray srcArr = kv.value().as<JsonArray>();
                        
                        for (const auto& item : srcArr) {
                            arr.add(item);
                        }
                    } else {
                        params[kv.key().c_str()] = kv.value();
                    }
                }
            }
        } else {
            // Simple format - wrap in OpenAI format
            // Add this tool to the tools array with type: "function"
            JsonObject tool = tools.add<JsonObject>();
            tool["type"] = "function";
            
            JsonObject function = tool["function"].to<JsonObject>();
            
            // Copy all properties from the simple format to the function object
            for (JsonPair kv : tempDoc.as<JsonObject>()) {
                if (kv.value().is<JsonObject>()) {
                    JsonObject subObj = function[kv.key().c_str()].to<JsonObject>();
                    JsonObject srcSubObj = kv.value().as<JsonObject>();
                    
                    for (JsonPair subKv : srcSubObj) {
                        subObj[subKv.key().c_str()] = subKv.value();
                    }
                } else if (kv.value().is<JsonArray>()) {
                    JsonArray arr = function[kv.key().c_str()].to<JsonArray>();
                    JsonArray srcArr = kv.value().as<JsonArray>();
                    
                    for (const auto& item : srcArr) {
                        arr.add(item);
                    }
                } else {
                    function[kv.key().c_str()] = kv.value();
                }
            }
        }
    }
    
    String requestBody;
    serializeJson(doc, requestBody);
    return requestBody;
}

String AI_API_OpenAI_Handler::parseToolCallsResponseBody(const String& responsePayload,
                                                        String& errorMsg, JsonDocument& doc) {
    resetState(); // Reset finish reason and tokens before parsing
    doc.clear();
    errorMsg = ""; // Clear previous error

    DeserializationError error = deserializeJson(doc, responsePayload);
    if (error) {
        errorMsg = "JSON Deserialization failed: " + String(error.c_str());
        return "";
    }

    if (!doc["error"].isNull()) {
        errorMsg = String("API Error: ") + (doc["error"]["message"] | "Unknown error");
        return "";
    }

    // Extract total tokens if available
    if (doc["usage"].is<JsonObject>()) {
        JsonObject usage = doc["usage"];
        if (!usage["total_tokens"].isNull()) {
            _lastTotalTokens = usage["total_tokens"].as<int>(); // Store in base class member
        }
    }

    if (doc["choices"].is<JsonArray>() && doc["choices"].size() > 0) {
       JsonObject firstChoice = doc["choices"][0];

       // Extract finish reason if available
       if (!firstChoice["finish_reason"].isNull()) {
           _lastFinishReason = firstChoice["finish_reason"].as<String>(); // Store in base class member
       }

       if (firstChoice["message"].is<JsonObject>()) {
           JsonObject message = firstChoice["message"];
           
           // Check if this is a tool call response
           if (message["tool_calls"].is<JsonArray>()) {
               // Return the entire tool_calls array as a JSON string
               String toolCallsJson;
               serializeJson(message["tool_calls"], toolCallsJson);
               return toolCallsJson;
           }
           
           // If no tool calls, check for regular content
           if (message["content"].is<const char*>()) {
               return message["content"].as<String>();
           }
       }
    }

    errorMsg = "Could not find 'choices[0].message.content' or 'choices[0].message.tool_calls' in response.";
    return ""; // Return empty string if content not found
}

String AI_API_OpenAI_Handler::buildToolCallsFollowUpRequestBody(const String& modelName,
                                                          const String* toolsArray, int toolsArraySize,
                                                          const String& systemMessage, const String& toolChoice,
                                                          const String& lastUserMessage,
                                                          const String& lastAssistantToolCallsJson,
                                                          const String& toolResultsJson,
                                                          int followUpMaxTokens,
                                                          const String& followUpToolChoice,
                                                          JsonDocument& doc) {
    // Clear the document first
    doc.clear();

    // Set the model
    doc["model"] = modelName;
    
    // Add max_completion_tokens parameter if specified
    if (followUpMaxTokens > 0) {
        doc["max_completion_tokens"] = followUpMaxTokens;
    }
    
    // Add messages array
    JsonArray messages = doc["messages"].to<JsonArray>();
    
    // Add system message if specified
    if (systemMessage.length() > 0) {
        JsonObject systemMsg = messages.add<JsonObject>();
        systemMsg["role"] = "system";
        systemMsg["content"] = systemMessage;
    }
    
