HadyBazzi/ESP32_AI_Connect/src/AI_API_OpenAI.cpp
    // Add the original user message
    JsonObject userMsg = messages.add<JsonObject>();
    userMsg["role"] = "user";
    userMsg["content"] = lastUserMessage;
    
    // Add the assistant's tool call response
    JsonObject assistantMsg = messages.add<JsonObject>();
    assistantMsg["role"] = "assistant";
    
    // Parse and add the tool calls
    JsonDocument toolCallsDoc;
    DeserializationError error = deserializeJson(toolCallsDoc, lastAssistantToolCallsJson);
    if (!error && toolCallsDoc.is<JsonArray>()) {
        JsonArray toolCalls = assistantMsg["tool_calls"].to<JsonArray>();
        
        // Copy each tool call
        for (JsonVariant toolCall : toolCallsDoc.as<JsonArray>()) {
            JsonObject newToolCall = toolCalls.add<JsonObject>();
            
            // Copy all properties of the tool call
            for (JsonPair kv : toolCall.as<JsonObject>()) {
                if (kv.value().is<JsonObject>()) {
                    JsonObject subObj = newToolCall[kv.key().c_str()].to<JsonObject>();
                    JsonObject srcSubObj = kv.value().as<JsonObject>();
                    
                    for (JsonPair subKv : srcSubObj) {
                        subObj[subKv.key().c_str()] = subKv.value();
                    }
                } else {
                    newToolCall[kv.key().c_str()] = kv.value();
                }
            }
        }
    }
    
    // Parse and add tool results as tool messages
    JsonDocument toolResultsDoc;
    error = deserializeJson(toolResultsDoc, toolResultsJson);
    if (!error && toolResultsDoc.is<JsonArray>()) {
        for (JsonVariant result : toolResultsDoc.as<JsonArray>()) {
            JsonObject toolMsg = messages.add<JsonObject>();
            toolMsg["role"] = "tool";
            
            // Copy tool_call_id from the result
            if (!result["tool_call_id"].isNull()) {
                toolMsg["tool_call_id"] = result["tool_call_id"];
            }
            
            // Extract content from function.output
            if (result["function"].is<JsonObject>()) {
                JsonObject function = result["function"];
                if (!function["output"].isNull()) {
                    toolMsg["content"] = function["output"];
                }
            }
        }
    }
    
    // Add follow-up tool_choice if specified
    if (followUpToolChoice.length() > 0) {
        String trimmedChoice = followUpToolChoice;
        trimmedChoice.trim();
        
        // Check if it's one of the allowed string values
        if (trimmedChoice == "auto" || trimmedChoice == "none" || trimmedChoice == "required") {
            // Simple string values can be added directly
            doc["tool_choice"] = trimmedChoice;
        } 
        // Check if it starts with { - might be a JSON object string
        else if (trimmedChoice.startsWith("{")) {
            // Try to parse it as a JSON object
            JsonDocument toolChoiceDoc;
            DeserializationError error = deserializeJson(toolChoiceDoc, trimmedChoice);
            
            if (!error) {
                // Successfully parsed as JSON - add as an object
                JsonObject toolChoiceObj = doc["tool_choice"].to<JsonObject>();
                
                // Copy all fields from the parsed JSON
                for (JsonPair kv : toolChoiceDoc.as<JsonObject>()) {
                    if (kv.value().is<JsonObject>()) {
                        JsonObject subObj = toolChoiceObj[kv.key().c_str()].to<JsonObject>();
                        JsonObject srcSubObj = kv.value().as<JsonObject>();
                        
                        for (JsonPair subKv : srcSubObj) {
                            subObj[subKv.key().c_str()] = subKv.value();
                        }
                    } else {
                        toolChoiceObj[kv.key().c_str()] = kv.value();
                    }
                }
            } else {
                // Not valid JSON - add as string but this will likely cause an API error
                #ifdef ENABLE_DEBUG_OUTPUT
                Serial.println("Warning: follow-up tool_choice value is not valid JSON: " + trimmedChoice);
                #endif
                doc["tool_choice"] = trimmedChoice;
            }
        } else {
            // Not a recognized string value or JSON - add as string but will likely cause an API error
            #ifdef ENABLE_DEBUG_OUTPUT
            Serial.println("Warning: follow-up tool_choice value is not recognized: " + trimmedChoice);
            #endif
            doc["tool_choice"] = trimmedChoice;
        }
    }
    
    // Add tools array
    JsonArray tools = doc["tools"].to<JsonArray>();
    
    // Parse and add each tool from the toolsArray (same logic as buildToolCallsRequestBody)
    for (int i = 0; i < toolsArraySize; i++) {
        // Create a temporary JsonDocument to parse the tool JSON string
        JsonDocument tempDoc;
        DeserializationError error = deserializeJson(tempDoc, toolsArray[i]);
        
        if (error) {
            // Skip invalid JSON
            continue;
        }
        
        // Check if the tool is already in OpenAI format (has 'type' and 'function' fields)
        if (!tempDoc["type"].isNull() && !tempDoc["function"].isNull()) {
            // Already in OpenAI format - copy directly to tools array
            JsonObject tool = tools.add<JsonObject>();
            
            // Copy type
            tool["type"] = tempDoc["type"];
            
            // Copy function
            JsonObject function = tool["function"].to<JsonObject>();
            JsonObject srcFunction = tempDoc["function"];
            
            // Copy function properties
            if (!srcFunction["name"].isNull()) {
                function["name"] = srcFunction["name"].as<String>();
            }
            
            if (!srcFunction["description"].isNull()) {
                function["description"] = srcFunction["description"].as<String>();
            }
            
            if (!srcFunction["parameters"].isNull()) {
                JsonObject params = function["parameters"].to<JsonObject>();
                JsonObject srcParams = srcFunction["parameters"];
                
