HadyBazzi/ESP32_AI_Connect/src/AI_API_OpenAI.cpp
                for (JsonPair kv : srcParams) {
                    if (kv.value().is<JsonObject>()) {
                        JsonObject subObj = params[kv.key().c_str()].to<JsonObject>();
                        JsonObject srcSubObj = kv.value().as<JsonObject>();
                        
                        for (JsonPair subKv : srcSubObj) {
                            subObj[subKv.key().c_str()] = subKv.value();
                        }
                    } else if (kv.value().is<JsonArray>()) {
                        JsonArray arr = params[kv.key().c_str()].to<JsonArray>();
                        JsonArray srcArr = kv.value().as<JsonArray>();
                        
                        for (const auto& item : srcArr) {
                            arr.add(item);
                        }
                    } else {
                        params[kv.key().c_str()] = kv.value();
                    }
                }
            }
        } else {
            // Simple format - wrap in OpenAI format
            // Add this tool to the tools array with type: "function"
            JsonObject tool = tools.add<JsonObject>();
            tool["type"] = "function";
            
            JsonObject function = tool["function"].to<JsonObject>();
            
            // Copy all properties from the simple format to the function object
            for (JsonPair kv : tempDoc.as<JsonObject>()) {
                if (kv.value().is<JsonObject>()) {
                    JsonObject subObj = function[kv.key().c_str()].to<JsonObject>();
                    JsonObject srcSubObj = kv.value().as<JsonObject>();
                    
                    for (JsonPair subKv : srcSubObj) {
                        subObj[subKv.key().c_str()] = subKv.value();
                    }
                } else if (kv.value().is<JsonArray>()) {
                    JsonArray arr = function[kv.key().c_str()].to<JsonArray>();
                    JsonArray srcArr = kv.value().as<JsonArray>();
                    
                    for (const auto& item : srcArr) {
                        arr.add(item);
                    }
                } else {
                    function[kv.key().c_str()] = kv.value();
                }
            }
        }
    }
    
    String requestBody;
    serializeJson(doc, requestBody);
    return requestBody;
}
#endif

#endif // USE_AI_API_OPENAI